Revit 2024 API
ElectricalSetting.CircuitLoadCalculationMethod Property
 The method to calculate circuit load
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public CircuitLoadCalculationMethod CircuitLoadCalculationMethod { get; set; }
Visual Basic
Public Property CircuitLoadCalculationMethod As CircuitLoadCalculationMethod
	Get
	Set
Visual C++
public:
property CircuitLoadCalculationMethod CircuitLoadCalculationMethod {
	CircuitLoadCalculationMethod get ();
	void set (CircuitLoadCalculationMethod value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace